# Core utilities
brew "ack"
brew "fd"
brew "fzf"
brew "fzy"
brew "gnu-tar"
brew "htop"
brew "make"
brew "readline"
brew "ripgrep"
brew "the_silver_searcher"
brew "tree"
brew "unzip"
brew "wget"

# Shell
brew "fish"
brew "starship"

# Terminal
brew "tmux"
brew "urlview"

# Git
brew "git"
brew "git-extras"
brew "gh"
brew "lazygit"

# Development dependencies
brew "libxslt"
brew "llvm"
brew "wxwidgets"
brew "ruby-build"
brew "libsodium"
brew "watchman"

# LSP servers
brew "ansible-lint"
brew "efm-langserver"
brew "lua-language-server"
brew "vscode-langservers-extracted"
brew "stylua"

# Version manager
brew "mise"

# Misc tools
brew "ansible"
brew "arttime"
brew "ddgr"
brew "direnv"
brew "fop"
brew "mosh"
brew "nnn"
brew "pinentry-mac"
brew "pngpaste"
brew "redis"
brew "terminal-notifier"

# Databases
brew "mariadb@10.6"
brew "mysql@8.0"
brew "postgresql@18"

# MAS CLI
brew "mas"

# Common MAS apps (all hosts)
mas "Black Out", id: 1319884285
mas "Fantastical", id: 975937182
mas "Flycut", id: 442160987
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "MindNode 5", id: 1289197285
mas "Moneywiz", id: 1511185140
mas "Pages", id: 409201541
mas "Spark", id: 6445813049
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835

# Common casks (all hosts)
cask "1password"
cask "1password-cli"
cask "firefox"
cask "font-fantasque-sans-mono"
cask "font-fira-code-nerd-font"
cask "keycastr"
cask "kitty"
cask "logi-options+"
cask "microsoft-office"
cask "notion"
